app/controllers/foods_controller.rb

  def create
    @user = current_user
    @food = Food.new(food_params)
    @food.user = user

    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Pizza"], ["measurement_unit", "2"], ["price", "3.0"], ["quantity", 33], ["user_id", nil], ["created_at", "2022-08-04 13:15:06.961314"], ["updated_at", "2022-08-04 13:15:06.961314"]]

  def destroy
    user = current_user
    @food.destroy
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]