app/controllers/public_recipes_controller.rb

SELECT 1 AS one FROM "recipes" WHERE "recipes"."public" = $1 AND "recipes"."user_id" != $2 LIMIT $3  [["public", true], ["user_id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index
    @recipes = Recipe.includes(:user).where(public: true).where.not(user_id: current_user.id).order(created_at: :desc)
    @public_recipes = []

    return if @recipes.empty?

    @recipes.each do |recipe|
      recipe_food = RecipesFood.where(recipe_id: recipe.id)
      next if recipe_food.empty?

      food_items = recipe_food[0].quantity
      food = Food.find(recipe_food[0].food_id)
      author = User.find(food.user_id)