app/controllers/recipe_foods_controller.rb

  def index
    @recipe_foods = RecipeFood.all
---
SELECT "recipe_foods".* FROM "recipe_foods"

  def new
    @recipe_food = RecipeFood.new
    @recipe = Recipe.find(params[:recipe_id])
    @foods = Food.where(user_id: current_user.id)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 3]]

  def create # rubocop:todo Metrics/AbcSize, Metrics/MethodLength
    @foods = Food.where(user_id: current_user.id)
    @food = Food.find(recipe_food_params['food'])
    @recipe = Recipe.find(params[:recipe_id])
    @recipe_food = RecipeFood.new(quantity: recipes_food_params['quantity'].to_i, food: @food, recipe: @recipe)

    respond_to do |format| # rubocop:todo Metrics/BlockLength
      if @recipe_food.save
---
INSERT INTO "recipe_foods" ("quantity", "recipe_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", "444.0"], ["recipe_id", nil], ["food_id", nil], ["created_at", "2022-08-05 17:40:30.948728"], ["updated_at", "2022-08-05 17:40:30.948728"]]

  def set_recipe_food
    @recipe_food = RecipeFood.find(params[:id])
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]