app/controllers/recipes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 ORDER BY "recipes"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 4]]
---
  def show
    @recipe = Recipe.includes(:user).where(id: params[:id]).first
    @recipe_foods = RecipeFood.includes(:food, :recipe).where(recipe_id: params[:id])

INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save